/*
 
 Ця дз складається з чотирьох невеликих завдань, за реалізацію кожної з них можна отримати 25 балів:

Дано масив з елементами різних типів. Створити функцію яка вираховує середнє арифметичне лише числових елементів даного масиву.
Написати функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x і y, рядок znak. У змінній znak може бути: +, -, *, /, %, ^ (ступінь ).Вивести результат математичної дії, вказаної в змінній znak.Обидва числа і знак виходять від користувача.
Написати функцію заповнення даними користувача двомірного масиву. Довжину основного масиву і внутрішніх масивів задає користувач. Значення всіх елементів всіх масивів задає користувач.
Створити функцію, яка прибирає з рядка всі символи, які ми передали другим аргументом. 'func(" hello world", ['l', 'd'])' поверне нам "heo wor". Вихідний рядок та символи для видалення задає користувач.
 
 */

// Дано масив з елементами різних типів. Створити функцію яка вираховує середнє арифметичне лише числових елементів даного масиву.

function averageInt(array) {
    let sum = 0;
    let count = 0;
    length = array.length;
    for (let i = 0; i < length; i++) {
        if (isNaN(+array[i]) === false) {
            sum += array[i];
            count += 1;
        }
    }
    console.log(sum, `sum`, count, `count`);
    return sum / count;
}
const array = [1, 2, "apple", 3, 4, 5, 6, 7, 8, "noodles", 9, "banana", 10, "orange"];
console.log(averageInt(array), `averageInt`);

// Написати функцію doMath(x, znak, y), яка отримує 3 аргументи: числа x і y, рядок znak. У змінній znak може бути: +, -, *, /, %, ^ (ступінь ).Вивести результат математичної дії, вказаної в змінній znak.Обидва числа і знак виходять від користувача.

function doMath(x, znak, y) {
    console.log(arguments);
    return arguments.joim(znak);
}

console.log(doMath(5,"*", 5));