/* 1) Написати функцію assignObjects(obj1, obj2), яка приймає аргументами 2 об'єкти і повертає новий, який складається з властивостей обох об'єктів (склеїти). Якщо властивість повторюється, взяти значення другого об'єкта:
Наприклад: 
assignObjects({ x: 10, y: 20 }, { z: 30 }) -> { x:10, y:20, z: 30 }
assignObjects({ x: 10 }, { x: 20, y: 30 }) - > { x:20, y: 30 } */

function assignObjects(obj1, obj2) {
  const newObj = { ...obj1, ...obj2 };
  return newObj;
}

/* 2) Адаптувати функцію assignObjects() під невизначену кількість об'єктів. assignObjects(obj1, obj2, ....., objn); */



/* 3) Додати третій аргумент flag, який є boolean. Якщо flag === true, тоді за наявності властивості в обох об'єктів у результат піде значення першого об'єкта, false - з другого
Наприклад: 
assignObjects({a: 12, b: 3}, { a: 13, h: 0 }, true); => { a: 12, b: 3, h: 0 } */



/* 4) зробити параметр flag не обов'язковий, якщо параметр не переданий – то за замовченням він буде false */

