// Реалізувати калькулятор, у якому є слайдер(`input type=”range”`) та поле введення(`input type=”number”`).

// Змінюючи стан range змінюється стан поля введення`number`.І навпаки.

// Реалізувати блок - діаграму, який у пікселях відображатиме значення range.Наприклад - range вибрали число 83, висота блоку зеленого кольору буде 83 пікселі.

// Червоний блок – кількість комісії.Комісія обчислюється за такою формулою:

// (range < 20) -> 2 %
//     (20 - 50) -> 4 %
//     (50 - 75) -> 6 %
//     (75 - 100) -> 8 %

//     Наприклад, значення вибору 100, комісія буде 8 %.Результатова сума: 108. Висота червоного блоку - 8px






















